#define _MEMORY_H
#ifdef _MEMORY_H
#define EEP_PARAM_ADDR	0x0000



enum												//保存地址
{
	EEP_BASE = EEP_PARAM_ADDR,
	EEP_COUNTRY_TB,
	EEP_COUNTRY,	
	EEP_BAND,			
	EEP_CHANNEL,		
	EEP_MODU,		
	EEP_POWER,		
	EEP_VOL,
	EEP_LAST_CH,
	EEP_IS_ASQ,
	EEP_IS_VOX,
	EEP_ASQ_LEVEL,	
	EEP_LCD_COLOR, 
	EEP_TONE_SW,
	EEP_SPK_SW                            //14
	
};
/*-------------------------------------------------------------------------
*函数：saveData  保存数据
*参数：addr 地址  数据  
*返回值：无
*-------------------------------------------------------------------------*/
void saveData(u16 addr, u8 dat);
/*-------------------------------------------------------------------------
*函数：initMemory  初使加载功能信息
*参数：无   
*返回值：无
*-------------------------------------------------------------------------*/
void initMemory(void);
/*-------------------------------------------------------------------------
*函数：saveAllParam        保存所有数据
*参数：无
*返回值：无
*-------------------------------------------------------------------------*/
void saveAllParam(void);
/*-------------------------------------------------------------------------
*函数：ResetParam  初使化设置
*参数：无   
*返回值：无
*-------------------------------------------------------------------------*/
void ResetParam();
#endif