#define _VCO_H
#ifdef _VCO_H

#define IF  10.7
#define IF4802 (-0.14)
#define CAFREQ 0.00056
#define BK4802_EXP			   (8388608 / 21.7)   //4802频率转化参数  2^23/Fxat
#define BK4802_FADE_EXP        (20 / 29.091)	  //4802  35-41M盲区转化参数   100/145.5  即写变化 100Hz 进去 实际变化为145.5Hz
#define FADE_1				    25.3500           //盲区（36.872）对应值
#define FADE_2				    26.1221			  //盲区（37.995）对应值
#define FADE_3				    26.8942			  //盲区（39.118）对应值
#define FADE_4				    27.6683			  //盲区（40.244）对应值

/*-------------------------------------------------------------------------
*函数：calculateFreq  计算发射 接收频率  
*参数： 
*返回值：无
*-------------------------------------------------------------------------*/
void calculateFreq(void);

#endif